app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        # @article = Article.new
        # @article.title = params[:article][:title]
        # @article.body = params[:article][:body]
        # Alternative way
            # @article = Article.new(
            #     title: params[:article][:title],
            #     body: params[:article][:body]
            # )
        @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2020-09-23 23:06:13.303016"], ["updated_at", "2020-09-23 23:06:13.303016"]]

    def update
        @article = Article.find(params[:id])
        @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?