app/models/article.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 13]]
---
    def tag_list
        self.tags.collect do |tag|

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ruby,technology"], ["created_at", "2020-09-24 09:20:29.894303"], ["updated_at", "2020-09-24 09:20:29.894303"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "ruby,technology"], ["LIMIT", 1]]
---
    def tag_list=(tags_string)
        tag_names = tags_string.split(", ").collect{|s| s.strip.downcase}.uniq
        new_or_found_tags = tag_names.collect { |name| Tag.find_or_create_by(name: name) }